backend: tensorflow
class_name: Sequential
config:
- class_name: Conv1D
  config:
    activation: linear
    activity_regularizer: null
    batch_input_shape: !!python/tuple [null, 37, 1]
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: !!python/tuple [1]
    dtype: float32
    filters: 8
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3]
    name: conv1d_37
    padding: same
    strides: !!python/tuple [1]
    trainable: true
    use_bias: true
- class_name: BatchNormalization
  config:
    axis: -1
    beta_constraint: null
    beta_initializer:
      class_name: Zeros
      config: {}
    beta_regularizer: null
    center: true
    epsilon: 0.001
    gamma_constraint: null
    gamma_initializer:
      class_name: Ones
      config: {}
    gamma_regularizer: null
    momentum: 0.99
    moving_mean_initializer:
      class_name: Zeros
      config: {}
    moving_variance_initializer:
      class_name: Ones
      config: {}
    name: batch_normalization_9
    scale: true
    trainable: true
- class_name: Activation
  config: {activation: relu, name: activation_13, trainable: true}
- class_name: Conv1D
  config:
    activation: linear
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: !!python/tuple [1]
    filters: 8
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3]
    name: conv1d_38
    padding: same
    strides: !!python/tuple [1]
    trainable: true
    use_bias: true
- class_name: Conv1D
  config:
    activation: linear
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: !!python/tuple [1]
    filters: 16
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3]
    name: conv1d_39
    padding: valid
    strides: !!python/tuple [1]
    trainable: true
    use_bias: true
- class_name: Dropout
  config: {name: dropout_9, noise_shape: null, rate: 0.2, seed: null, trainable: true}
- class_name: Conv1D
  config:
    activation: linear
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: !!python/tuple [1]
    filters: 8
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3]
    name: conv1d_40
    padding: same
    strides: !!python/tuple [1]
    trainable: true
    use_bias: true
- class_name: Conv1D
  config:
    activation: linear
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: !!python/tuple [1]
    filters: 16
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3]
    name: conv1d_41
    padding: valid
    strides: !!python/tuple [1]
    trainable: true
    use_bias: true
- class_name: Activation
  config: {activation: relu, name: activation_14, trainable: true}
- class_name: Conv1D
  config:
    activation: linear
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: !!python/tuple [1]
    filters: 16
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3]
    name: conv1d_42
    padding: same
    strides: !!python/tuple [1]
    trainable: true
    use_bias: true
- class_name: Conv1D
  config:
    activation: linear
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: !!python/tuple [1]
    filters: 32
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3]
    name: conv1d_43
    padding: valid
    strides: !!python/tuple [1]
    trainable: true
    use_bias: true
- class_name: BatchNormalization
  config:
    axis: -1
    beta_constraint: null
    beta_initializer:
      class_name: Zeros
      config: {}
    beta_regularizer: null
    center: true
    epsilon: 0.001
    gamma_constraint: null
    gamma_initializer:
      class_name: Ones
      config: {}
    gamma_regularizer: null
    momentum: 0.99
    moving_mean_initializer:
      class_name: Zeros
      config: {}
    moving_variance_initializer:
      class_name: Ones
      config: {}
    name: batch_normalization_10
    scale: true
    trainable: true
- class_name: Conv1D
  config:
    activation: linear
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: !!python/tuple [1]
    filters: 32
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3]
    name: conv1d_44
    padding: same
    strides: !!python/tuple [1]
    trainable: true
    use_bias: true
- class_name: Conv1D
  config:
    activation: linear
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: !!python/tuple [1]
    filters: 64
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3]
    name: conv1d_45
    padding: same
    strides: !!python/tuple [1]
    trainable: true
    use_bias: true
- class_name: Activation
  config: {activation: relu, name: activation_15, trainable: true}
- class_name: Dropout
  config: {name: dropout_10, noise_shape: null, rate: 0.4, seed: null, trainable: true}
- class_name: Bidirectional
  config:
    layer:
      class_name: LSTM
      config:
        activation: tanh
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        dropout: 0.0
        go_backwards: false
        implementation: 1
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
        kernel_regularizer: null
        name: lstm_5
        recurrent_activation: hard_sigmoid
        recurrent_constraint: null
        recurrent_dropout: 0.0
        recurrent_initializer:
          class_name: Orthogonal
          config: {gain: 1.0, seed: null}
        recurrent_regularizer: null
        return_sequences: true
        return_state: false
        stateful: false
        trainable: true
        unit_forget_bias: true
        units: 32
        unroll: false
        use_bias: true
    merge_mode: concat
    name: bidirectional_5
    trainable: true
- class_name: Flatten
  config: {data_format: channels_last, name: flatten_5, trainable: true}
- class_name: Dense
  config:
    activation: sigmoid
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    kernel_constraint: null
    kernel_initializer:
      class_name: RandomNormal
      config: {mean: 0.0, seed: null, stddev: 0.05}
    kernel_regularizer: null
    name: dense_5
    trainable: true
    units: 1
    use_bias: true
keras_version: 2.2.2
